public/media/8adb6be1097f8e6987e067e77b41bdf6.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://www.ibm.com/xmlns/prod/websphere/fabric/2009/12/telecom/operations/inventory/schema/ConfigurationUpdateMessage" xmlns:mod="http://www.ibm.com/xmlns/prod/websphere/fabric/2009/12/telecom/operations/inventory/types/schema/ModifyProduct" xmlns:v3="http://www.ibm.com/telecom/common/schema/mtosi/v3_0">
   <soapenv:Header/>
   <soapenv:Body>
      <mod:modifyProduct>
         <con:productConfigurationUpdate>
            <Id>NC_0000aZN</Id>
            <Name>Modify TELUS TV Product Order #0001074844</Name>
            <CharacteristicValue>
               <Characteristic>
                  <Name>customerId</Name>
               </Characteristic>
               <Value>92777806</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>orderType</Name>
               </Characteristic>
               <Value>Modify</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>billingAccountNumber</Name>
               </Characteristic>
               <Value>602195023</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>customerOfferCurrency</Name>
               </Characteristic>
               <Value>CAD</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>productType</Name>
               </Characteristic>
               <Value>TTV</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>productExternalId</Name>
               </Characteristic>
               <Value>1000148010</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>suspendStatus</Name>
               </Characteristic>
               <Value>NA</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>forborneStatus</Name>
               </Characteristic>
               <Value>N</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>activityReason</Name>
               </Characteristic>
               <Value>CREQ</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>activityCode</Name>
               </Characteristic>
               <Value>CP</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>activityOrigin</Name>
               </Characteristic>
               <Value>OMS</Value>
            </CharacteristicValue>
            <CharacteristicValue>
               <Characteristic>
                  <Name>activityDate</Name>
               </Characteristic>
               <Value>2015-11-06T12:00:00-07:00</Value>
            </CharacteristicValue>
            <Specification>
               <Name>Consumer</Name>
               <Type>Billing</Type>
               <Category>Product Order</Category>
            </Specification>
            <ServiceConfigurationItem>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>addressType</Name>
                  </Characteristic>
                  <Value>S</Value>
               </CharacteristicValue>
               <Address>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>externalServiceAddressId</Name>
                     </Characteristic>
                     <Value>AB000978011</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>apartmentNumber</Name>
                     </Characteristic>
                     <Value>3</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>streetNumber</Name>
                     </Characteristic>
                     <Value>9821</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>streetName</Name>
                     </Characteristic>
                     <Value>99 AVE</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>streetDirection</Name>
                     </Characteristic>
                     <Value/>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>municipality</Name>
                     </Characteristic>
                     <Value>LAC LA BICHE</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>province</Name>
                     </Characteristic>
                     <Value>AB</Value>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>postalCode</Name>
                     </Characteristic>
                     <Value/>
                  </CharacteristicValue>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>locationPDSId</Name>
                     </Characteristic>
                     <Value>1134929</Value>
                  </CharacteristicValue>
               </Address>
            </ServiceConfigurationItem>
            <ProductConfigurationItem>
               <Id>A00015gWBV</Id>
               <Name>TELUS TV Product</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value>40618231</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890204</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>PrimaryPricePlan</Category>
               </Specification>
               <Action>Change</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Resource ID - TTV</Name>
                     </Characteristic>
                     <Value>100000036963</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Product</Type>
                     <Category>Resource</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A001000PHE</Id>
               <Name>Essentials</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value>21141029</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088224013889957</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>oldAssignedProductId</Name>
                  </Characteristic>
                  <Value>A08y000PHE</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>oldBillingOfferId</Name>
                  </Characteristic>
                  <Value>32396</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>Change</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A05W000PHF</Id>
               <Name>Essentials #0000395457</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value/>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890187</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>Delete</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A07Z000PHC</Id>
               <Name>Musicroom #0000395458</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value/>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890188</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>None</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A0Ae000PHD</Id>
               <Name>Stingray #0000395459</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value/>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890189</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>None</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A00M000PHN</Id>
               <Name>Essentials #0000395481</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value>21141029</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088275613890859</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>Add</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Bundle ID</Name>
                     </Characteristic>
                     <Value>A001000PHE</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Zero Rate For Bundle</Name>
                     </Characteristic>
                     <Value>Y</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>A0BB000PHB</Id>
               <Name>TV Installation #0000395460</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value/>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088241013890190</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Category>Offer</Category>
               </Specification>
               <Action>Delete</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
            <ProductConfigurationItem>
               <Id>0.0</Id>
               <Name>Bundle Discount Promotion Instance</Name>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>billingOfferId</Name>
                  </Characteristic>
                  <Value/>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemId</Name>
                  </Characteristic>
                  <Value>9144088242713890339</Value>
               </CharacteristicValue>
               <CharacteristicValue>
                  <Characteristic>
                     <Name>orderItemParentId</Name>
                  </Characteristic>
                  <Value>9144088241013890186</Value>
               </CharacteristicValue>
               <Specification>
                  <Type>Promotion</Type>
                  <Category>Offer</Category>
               </Specification>
               <Action>None</Action>
               <ComponentStatusNotificationItem>
                  <CharacteristicValue>
                     <Characteristic>
                        <Name>Original Offer Effective Date</Name>
                     </Characteristic>
                     <Value>2015-11-06T00:00:00</Value>
                  </CharacteristicValue>
                  <Specification>
                     <Type>Offer</Type>
                     <Category>Parameter</Category>
                  </Specification>
               </ComponentStatusNotificationItem>
            </ProductConfigurationItem>
         </con:productConfigurationUpdate>
      </mod:modifyProduct>
   </soapenv:Body>
</soapenv:Envelope>